; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v8)
             (pred_11 ?v10 ?v7)
             (pred_1 ?v2 ?v7)
             (pred_9 ?v4 ?v2 )
	     (pred_4 ?v2)
             (pred_7 ?v3)
             (pred_8 ?v10)
             (pred_3 ?v7)
             (pred_12 ?v2)
             (pred_6 ?v10)
             (pred_5 ?v2)
             (pred_2 ))



(:action op_1
:parameters (?v11 ?v6 ?v13 ?v5)
:precondition (and (pred_7 ?v11) (pred_7 ?v6) (pred_8 ?v13) (pred_3 ?v5)
          (pred_10 ?v11 ?v6) (pred_11 ?v13 ?v5)
                   (pred_1 ?v6 ?v5) (pred_4 ?v11) 
                   (pred_12 ?v6) (pred_6 ?v13))
:effect (and  (pred_5 ?v6) (not (pred_12 ?v6))))


(:action op_5
:parameters (?v11 ?v1)
:precondition (and (pred_7 ?v11) (pred_7 ?v1)
               (pred_4 ?v11) (pred_10 ?v11 ?v1) (pred_5 ?v1))
:effect (and (pred_4 ?v1) (not (pred_4 ?v11))))

(:action op_3
:parameters (?v11 ?v13)
:precondition (and (pred_7 ?v11) (pred_8 ?v13) 
                  (pred_4 ?v11) (pred_9 ?v13 ?v11) (pred_2 ))
:effect (and (pred_6 ?v13)
   (not (pred_9 ?v13 ?v11)) (not (pred_2 ))))


(:action op_4
:parameters (?v11 ?v12 ?v9)
:precondition (and (pred_7 ?v11) (pred_8 ?v12) (pred_8 ?v9)
                  (pred_4 ?v11) (pred_6 ?v9) (pred_9 ?v12 ?v11))
:effect (and (pred_6 ?v12) (pred_9 ?v9 ?v11)
        (not (pred_6 ?v9)) (not (pred_9 ?v12 ?v11))))

(:action op_2
:parameters (?v11 ?v13)
:precondition (and (pred_7 ?v11) (pred_8 ?v13) 
                  (pred_4 ?v11) (pred_6 ?v13))
:effect (and (pred_2 ) (pred_9 ?v13 ?v11) (not (pred_6 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_29 obj_28 obj_15 obj_03 obj_06 obj_26 obj_20 obj_09 obj_10 obj_22 obj_19 obj_30 obj_25 obj_18 obj_04 obj_27 obj_23 obj_07 obj_16 obj_31 obj_05 obj_14 obj_08 obj_17
    obj_01 obj_11 obj_12
    obj_21 obj_13 obj_02
    )

    (:init
       (pred_2)

       (pred_7 obj_24)
       (pred_7 obj_29)
       (pred_7 obj_28)
       (pred_7 obj_15)
       (pred_7 obj_03)
       (pred_7 obj_06)
       (pred_7 obj_26)
       (pred_7 obj_20)
       (pred_7 obj_09)
       (pred_7 obj_10)
       (pred_7 obj_22)
       (pred_7 obj_19)
       (pred_7 obj_30)
       (pred_7 obj_25)
       (pred_7 obj_18)
       (pred_7 obj_04)
       (pred_7 obj_27)
       (pred_7 obj_23)
       (pred_7 obj_07)
       (pred_7 obj_16)
       (pred_7 obj_31)
       (pred_7 obj_05)
       (pred_7 obj_14)
       (pred_7 obj_08)
       (pred_7 obj_17)
       (pred_3 obj_01)
       (pred_3 obj_11)
       (pred_3 obj_12)
       (pred_8 obj_21)
       (pred_8 obj_13)
       (pred_8 obj_02)

       (pred_10 obj_24 obj_06)
       (pred_10 obj_24 obj_29)
       (pred_10 obj_29 obj_26)
       (pred_10 obj_29 obj_28)
       (pred_10 obj_29 obj_24)
       (pred_10 obj_28 obj_20)
       (pred_10 obj_28 obj_15)
       (pred_10 obj_28 obj_29)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_15 obj_28)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_06 obj_22)
       (pred_10 obj_06 obj_26)
       (pred_10 obj_06 obj_24)
       (pred_10 obj_26 obj_19)
       (pred_10 obj_26 obj_20)
       (pred_10 obj_26 obj_29)
       (pred_10 obj_26 obj_06)
       (pred_10 obj_20 obj_30)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_20 obj_28)
       (pred_10 obj_20 obj_26)
       (pred_10 obj_09 obj_25)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_10 obj_18)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_22 obj_04)
       (pred_10 obj_22 obj_19)
       (pred_10 obj_22 obj_06)
       (pred_10 obj_19 obj_27)
       (pred_10 obj_19 obj_30)
       (pred_10 obj_19 obj_26)
       (pred_10 obj_19 obj_22)
       (pred_10 obj_30 obj_23)
       (pred_10 obj_30 obj_25)
       (pred_10 obj_30 obj_20)
       (pred_10 obj_30 obj_19)
       (pred_10 obj_25 obj_07)
       (pred_10 obj_25 obj_18)
       (pred_10 obj_25 obj_09)
       (pred_10 obj_25 obj_30)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_18 obj_10)
       (pred_10 obj_18 obj_25)
       (pred_10 obj_04 obj_31)
       (pred_10 obj_04 obj_27)
       (pred_10 obj_04 obj_22)
       (pred_10 obj_27 obj_05)
       (pred_10 obj_27 obj_23)
       (pred_10 obj_27 obj_19)
       (pred_10 obj_27 obj_04)
       (pred_10 obj_23 obj_14)
       (pred_10 obj_23 obj_07)
       (pred_10 obj_23 obj_30)
       (pred_10 obj_23 obj_27)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_07 obj_16)
       (pred_10 obj_07 obj_25)
       (pred_10 obj_07 obj_23)
       (pred_10 obj_16 obj_17)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_16 obj_07)
       (pred_10 obj_31 obj_05)
       (pred_10 obj_31 obj_04)
       (pred_10 obj_05 obj_14)
       (pred_10 obj_05 obj_27)
       (pred_10 obj_05 obj_31)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_23)
       (pred_10 obj_14 obj_05)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_17 obj_16)
       (pred_10 obj_17 obj_08)
       (pred_12 obj_15)
       (pred_12 obj_04)
       (pred_12 obj_17)
       (pred_1  obj_15 obj_01)
       (pred_1  obj_04 obj_11)
       (pred_1  obj_17 obj_12)
       (pred_5 obj_24)
       (pred_5 obj_29)
       (pred_5 obj_28)
       (pred_5 obj_03)
       (pred_5 obj_06)
       (pred_5 obj_26)
       (pred_5 obj_20)
       (pred_5 obj_09)
       (pred_5 obj_10)
       (pred_5 obj_22)
       (pred_5 obj_19)
       (pred_5 obj_30)
       (pred_5 obj_25)
       (pred_5 obj_18)
       (pred_5 obj_27)
       (pred_5 obj_23)
       (pred_5 obj_07)
       (pred_5 obj_16)
       (pred_5 obj_31)
       (pred_5 obj_05)
       (pred_5 obj_14)
       (pred_5 obj_08)

       (pred_11  obj_21 obj_01)
       (pred_11  obj_13 obj_11)
       (pred_11  obj_02 obj_12)
       (pred_9 obj_21 obj_09)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_02 obj_05)
       (pred_4 obj_03)
    )

    (:goal (and
       (pred_9 obj_21 obj_24)
       (pred_9 obj_02 obj_23)
    ))
(:constraints
  (always (not (pred_4 obj_27)))
)
)

; plan
1. (op_5 obj_03 obj_10)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_10)
   goals met: 0 of 2
2. (op_5 obj_10 obj_09)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_09)
   goals met: 0 of 2
3. (op_3 obj_09 obj_21)
   deleted: (pred_9 obj_21 obj_09) (pred_2)
   added: (pred_6 obj_21)
   goals met: 0 of 2
4. (op_5 obj_09 obj_20)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_20)
   goals met: 0 of 2
5. (op_5 obj_20 obj_30)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_30)
   goals met: 0 of 2
6. (op_5 obj_30 obj_23)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_23)
   goals met: 0 of 2
7. (op_5 obj_23 obj_14)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_14)
   goals met: 0 of 2
8. (op_5 obj_14 obj_05)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_05)
   goals met: 0 of 2
9. (op_4 obj_05 obj_02 obj_21)
   deleted: (pred_6 obj_21) (pred_9 obj_02 obj_05)
   added: (pred_6 obj_02) (pred_9 obj_21 obj_05)
   goals met: 0 of 2
10. (op_5 obj_05 obj_14)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_14)
   goals met: 0 of 2
11. (op_5 obj_14 obj_23)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_23)
   goals met: 0 of 2
12. (op_2 obj_23 obj_02)
   deleted: (pred_6 obj_02)
   added: (pred_2) (pred_9 obj_02 obj_23)
   goals met: 1 of 2
13. (op_5 obj_23 obj_14)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_14)
   goals met: 1 of 2
14. (op_5 obj_14 obj_05)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_05)
   goals met: 1 of 2
15. (op_3 obj_05 obj_21)
   deleted: (pred_9 obj_21 obj_05) (pred_2)
   added: (pred_6 obj_21)
   goals met: 1 of 2
16. (op_5 obj_05 obj_14)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_14)
   goals met: 1 of 2
17. (op_5 obj_14 obj_23)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_23)
   goals met: 1 of 2
18. (op_5 obj_23 obj_30)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_30)
   goals met: 1 of 2
19. (op_5 obj_30 obj_20)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_20)
   goals met: 1 of 2
20. (op_5 obj_20 obj_28)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_28)
   goals met: 1 of 2
21. (op_5 obj_28 obj_29)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_29)
   goals met: 1 of 2
22. (op_5 obj_29 obj_24)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_24)
   goals met: 1 of 2
23. (op_2 obj_24 obj_21)
   deleted: (pred_6 obj_21)
   added: (pred_2) (pred_9 obj_21 obj_24)
   goals met: 2 of 2
